Catalogs/ФорматыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФорматыЗагрузки</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СправочникВладелец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/БЛогер_Уровни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>БЛогер_Уровни</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инфо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внимание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отладка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФорматыЗагрузки/Ext/ManagerModule.bsl
Функция ОбщиеСведения(Соответствие) Экспорт

	Если Соответствие.Назначение <> "Документ ссылка: Поступление платежей" Тогда
	
		ВызватьИсключение "Для выбранного соответствия не поддерживается загрузка: "
							+ Соответствие.Назначение;
	
	КонецЕсли;
	
	Возврат Документы.ПоступлениеПлатежей.ОбщиеСведения();

КонецФункции // ()

Процедура ОбработатьНастройку(Соответствие, НастройкаЗагрузки, ТабличныйДокумент) Экспорт

	Если Соответствие.Назначение <> "Документ ссылка: Поступление платежей" Тогда
	
		ВызватьИсключение "Для выбранного соответствия не поддерживается загрузка: "
							+ Соответствие.Назначение;
	
	КонецЕсли;

	Платежи = Документы.ПоступлениеПлатежей
		.ЗаполнитьБазовыеЗначения(НастройкаЗагрузки)
		.ЗагрузитьДанные(Соответствие, ТабличныйДокумент)
		.Обработать()
	;
	
	Если Не ЗначениеЗаполнено(Платежи) Тогда
	
		Возврат;
	
	КонецЕсли;
	УправлениеЗагрузкамиДанных.ПоместитьТабличнуюЧастьВХранилище(
		ТабличныйДокумент,
		Платежи
	);
	
КонецПроцедуры

Функция ОбработатьОшибку(ИнформацияОбОшибке) Экспорт

	ОписаниеОшибки = УправленияСообщениями.СформироватьТекстОшибки(
		ИнформацияОбОшибке,
		"Ошибка при загрузке файла"
	);
	
	Данные = Новый Массив;
	Данные.Добавить(ОписаниеОшибки["Выражение"]);
	
	Логер = БЛогер_Логирование.Создать();
	БЛогер_Логирование.Добавить(
		Логер,
		ОписаниеОшибки["Стек"],
		Перечисления.БЛогер_Уровни.Ошибка
	);
	
	Возврат Данные;

КонецФункции // ()
